{
    "actions": [
        {
            "attack_bonus": 0,
            "desc": "The angatra makes two attacks with its claws.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 8,
            "damage_dice": "2d4",
            "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one creature. Hit: 10 (2d4 + 5) piercing damage, and the creature must succeed on a DC 15 Constitution saving throw or be paralyzed by pain until the end of its next turn.",
            "name": "Claw"
        }
    ],
    "alignment": "neutral evil",
    "armor_class": 17,
    "armor_desc": "natural armor",
    "challenge_rating": 6.0,
    "charisma": 15,
    "condition_immunities": "charmed, exhaustion, frightened, poisoned",
    "constitution": 18,
    "damage_immunities": "poison",
    "damage_resistances": "necrotic; bludgeoning, piercing, and slashing from nonmagical weapons",
    "dexterity": 20,
    "hit_dice": "10d8+40",
    "hit_points": 85,
    "id": "angatra",
    "intelligence": 8,
    "languages": "all languages it knew in life",
    "name": "Angatra",
    "perception": 4,
    "senses": "darkvision 60 ft., passive Perception 14",
    "size": "Medium",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "When a creature that can see the angatra's eyes starts its turn within 30 feet of the angatra, it must make a DC 13 Charisma saving throw if the angatra isn't incapacitated and can see the creature. On a failed saving throw, the creature has its pain threshold lowered, so that it becomes vulnerable to all damage types until the end of its next turn. Unless it's surprised, a creature can avoid the saving throw by averting its eyes at the start of its turn. A creature that averts its eyes can't see the angatra for one full round, when it chooses anew whether to avert its eyes again. If the creature looks at the angatra in the meantime, it must immediately make the save.",
            "name": "Agonizing Gaze"
        },
        {
            "attack_bonus": 0,
            "desc": "The angatra immediately recognizes any individual that is descended from its tribe. It has advantage on attack rolls against such creatures, and those creatures have disadvantage on saving throws against the angatra's traits and attacks.",
            "name": "Ancestral Wrath"
        }
    ],
    "speed": "50 ft.",
    "speed_json": {
        "walk": 50
    },
    "stealth": 8,
    "strength": 14,
    "subtype": "",
    "type": "undead",
    "wisdom": 12
}