{
    "actions": [
        {
            "desc": "The arcanaphage makes two tentacle attacks.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 6,
            "damage_dice": "2d8+4",
            "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 13 (2d8 + 4) bludgeoning damage.",
            "name": "Tentacle"
        }
    ],
    "alignment": "unaligned",
    "armor_class": "14",
    "challenge_rating": "4",
    "charisma": "8",
    "condition_immunities": "blinded, charmed, deafened, frightened, prone",
    "constitution": "16",
    "damage_resistances": "bludgeoning, piercing, and slashing from magical weapons",
    "dexterity": "18",
    "hit_dice": "8d8+24",
    "hit_points": "60",
    "id": "arcanaphage",
    "intelligence": "2",
    "languages": "-",
    "name": "Arcanaphage",
    "perception": 2,
    "reactions": [
        {
            "desc": "The arcanaphage's tentacles glow when a spell is cast within 30 feet of it, countering the spell. This reaction works like the counterspell spell, except the arcanaphage must always make a spellcasting ability check, no matter the spell level. Its ability check for this is +5. If it successfully counters the spell, the arcanaphage feeds.",
            "name": "Voracious"
        }
    ],
    "senses": "blindsight 60 ft. (blind beyond this radius), passive Perception 12",
    "size": "Medium",
    "special_abilities": [
        {
            "desc": "When an arcanaphage dies, it explodes in a surge of partially-digested magical energy. Each creature within 5 feet per Feed score must make a DC 14 Dexterity saving throw, taking 3 (1d6) force damage per Feed score on a failed save, or half as much damage on a successful one. For 1 minute afterward, the affected area is awash with volatile magic. A creature that starts its turn in the affected area takes 7 (2d6) force damage.",
            "name": "Arcane Discharge"
        },
        {
            "desc": "Each time it feeds in combat, it regains hp equal to twice the level of the spell it ate and increases its Feed score by 1. The arcanaphage can't have a Feed score higher than 8, and its Feed score reduces by 1 each time it finishes a long rest.",
            "name": "Hunger"
        },
        {
            "desc": "At the start of each of the arcanaphage's turns, each creature within 30 feet of it that is currently maintaining concentration on a spell must make a DC 14 Constitution saving throw. On a failure, the creature's spell ends and the arcanaphage feeds.",
            "name": "Ingest Magic"
        },
        {
            "desc": "The arcanaphage is immune to damage from spells. It has advantage on saving throws against all other magical effects.",
            "name": "Magic Immunity"
        }
    ],
    "speed": "0 ft., fly 30 ft. (hover)",
    "speed_json": {
        "fly": 30,
        "hover": true,
        "walk": 0
    },
    "strength": "10",
    "subtype": "",
    "type": "monstrosity",
    "wisdom": "10"
}