{
    "actions": [
        {
            "attack_bonus": 0,
            "desc": "The bagiennik makes two claw attacks.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 6,
            "damage_dice": "4d6",
            "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 18 (4d6 + 4) slashing damage.",
            "name": "Claw"
        },
        {
            "attack_bonus": 6,
            "damage_dice": "2d10",
            "desc": "Ranged Weapon Attack: +6 to hit, range 15 ft., one target. Hit: 14 (2d10 + 3) acid damage. The target must make a successful DC 13 Dexterity saving throw or fall prone in the slick oil, which covers an area 5 feet square. A creature that enters the oily area or ends its turn there must also make the Dexterity saving throw to avoid falling prone. A creature needs to make only one saving throw per 5-foot-square per turn, even if it enters and ends its turn in the area. The slippery effect lasts for 3 rounds.",
            "name": "Acid Spray"
        }
    ],
    "alignment": "chaotic neutral",
    "armor_class": 15,
    "armor_desc": "natural armor",
    "challenge_rating": 3.0,
    "charisma": 11,
    "constitution": 16,
    "dexterity": 18,
    "hit_dice": "10d8+30",
    "hit_points": 75,
    "id": "bagiennik",
    "intelligence": 9,
    "languages": "Common",
    "name": "Bagiennik",
    "perception": 5,
    "senses": "darkvision 60 ft., passive Perception 15",
    "size": "Medium",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "A bagiennik can automatically stabilize a dying creature by using an action to smear some of its oily secretion on the dying creature's flesh. A similar application on an already-stable creature or one with 1 or more hit points acts as a potion of healing, restoring 2d4 + 2 hit points. Alternatively, the bagiennik's secretion can have the effect of a lesser restoration spell. However, any creature receiving a bagiennik's Healing Oil must make a successful DC 13 Constitution saving throw or be slowed for 1 minute.",
            "name": "Healing Oil"
        }
    ],
    "speed": "30 ft., swim 40 ft.",
    "speed_json": {
        "swim": 40,
        "walk": 30
    },
    "strength": 16,
    "subtype": "",
    "type": "aberration",
    "wisdom": 16
}