{
    "actions": [
        {
            "attack_bonus": 0,
            "desc": "The bone collective makes two claw attacks, or one claw and one bite attack, or one swarm attack.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 8,
            "damage_dice": "4d12",
            "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 31 (4d12 + 5) piercing damage, and the target must make a DC 16 Constitution save or suffer the effects of Wyrmblood Venom.",
            "name": "Bite"
        },
        {
            "attack_bonus": 8,
            "damage_dice": "3d12",
            "desc": "Melee Weapon Attack: +8 to hit, reach 5 ft., one target. Hit: 25 (3d12 + 5) slashing damage.",
            "name": "Claw"
        },
        {
            "attack_bonus": 8,
            "damage_dice": "8d12",
            "desc": "Melee Weapon Attack: +8 to hit, reach 0 ft., one creature in the swarm's space. Hit: 57 (8d12 + 5) piercing damage, or 31 (4d12 + 5) piercing damage if the bone collective has half its hit points or fewer. If the attack hits, the target must make a successful DC 15 Constitution save or suffer the effects of Wyrmblood Venom.",
            "name": "Swarm"
        },
        {
            "attack_bonus": 0,
            "desc": "Bone collectives create a reddish liquid, which they smear on their fangs. The freakish red mouths on the tiny skeletons are disturbing, and the toxin is deadly. A bitten creature must succeed on a DC 15 Constitution saving throw or become poisoned and take 1d6 Charisma damage. A poisoned creature repeats the saving throw every four hours, taking another 1d6 Charisma damage for each failure, until it has made two consecutive successful saves or survived for 24 hours. If the creature survives, the effect ends and the creature can heal normally. Lost Charisma can be regained with a lesser restoration spell or comparable magic.",
            "name": "Wyrmblood Venom (Injury)"
        }
    ],
    "alignment": "chaotic evil",
    "arcana": 5,
    "armor_class": 17,
    "armor_desc": "natural armor",
    "challenge_rating": 8.0,
    "charisma": 16,
    "condition_immunities": "exhaustion, poisoned",
    "constitution": 18,
    "damage_immunities": "necrotic, poison",
    "damage_resistances": "bludgeoning, piercing, and slashing damage from nonmagical weapons that aren't silvered",
    "deception": 6,
    "dexterity": 20,
    "dexterity_save": 8,
    "hit_dice": "16d6+64",
    "hit_points": 120,
    "id": "bone_collective",
    "intelligence": 14,
    "languages": "Common, Darakhul",
    "name": "Bone Collective",
    "perception": 3,
    "senses": "darkvision 120 ft., passive Perception 13",
    "size": "Small",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "All elements of a bone collective within 50 miles of their main body constantly communicate with each other. If one is aware of a particular danger, they all are. Any bone collective with at least 30 hit points forms a hive mind, giving it an Intelligence of 14. Below this hp threshold, it becomes mindless (Intelligence 0) and loses its innate spellcasting ability. At 0 hp, a few surviving sets of bones scatter, and must spend months to create a new collective.",
            "name": "Hive Mind"
        },
        {
            "attack_bonus": 0,
            "desc": "the bone collective's innate spellcasting ability is Charisma (spell save DC 14, +6 to hit with spell attacks). It can innately cast the following spells, requiring no material components:\n\nat will: chill touch\n\n3/day: animate dead (up to 5 skeletons or zombies)",
            "name": "Innate Spellcasting"
        },
        {
            "attack_bonus": 0,
            "desc": "A bone collective can act as a swarm (composed of smaller elements), or it can grant a single member (called an exarch) control, acting as a singular creature. Changing between forms takes one action. In its singular form, the collective can't occupy the same space as another creature, but it can perform sneak attacks and cast spells. In swarm form, the bone collective can occupy another creature's space and vice versa, and it can move through openings at least 1 foot square. It can't change to singular form while it occupies the same space as another creature. It uses its skills normally in either form.",
            "name": "Swarm"
        }
    ],
    "speed": "30 ft.",
    "speed_json": {
        "walk": 30
    },
    "stealth": 11,
    "strength": 10,
    "subtype": "",
    "type": "undead",
    "wisdom": 10
}