{
    "actions": [
        {
            "attack_bonus": 0,
            "desc": "The dream eater makes one bite attack and one claw attack.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 7,
            "damage_dice": "2d8",
            "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d8 + 2) piercing damage, and the target is grappled (escape DC 12).",
            "name": "Bite"
        },
        {
            "attack_bonus": 7,
            "damage_dice": "4d10",
            "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 24 (4d10 + 2) slashing damage.",
            "name": "Claw"
        },
        {
            "attack_bonus": 0,
            "desc": "A creature that ends its turn grappled by a dream eater is restrained until the end of its next turn, it takes 5 (1d4 + 3) psychic damage, and the dream eater gains the same number of temporary hit points.",
            "name": "Dream Eater's Caress"
        },
        {
            "attack_bonus": 0,
            "desc": "The dream eater secretes an oily chemical that most creatures find intoxicating. All living creatures within 30 feet must succeed on a DC 14 Constitution saving throw against poison or be poisoned for 2d4 rounds. While poisoned this way, the creature is stunned. Creatures that successfully save are immune to that dream eater's lotus scent for 24 hours.",
            "name": "Lotus Scent (Recharge 6)"
        },
        {
            "attack_bonus": 0,
            "desc": "Every creature within 20 feet of the dream eater must make a DC 16 Charisma saving throw. Those that fail enter waking dreams and are confused (as the spell) for 6 rounds. On turns when the creature can act normally (rolls 9 or 10 for the confusion effect), it can repeat the saving throw at the end of its turn, and the effect ends early on a successful save.",
            "name": "Waking Dreams (1/Day)"
        }
    ],
    "alignment": "lawful evil",
    "armor_class": 15,
    "armor_desc": "natural armor",
    "challenge_rating": "5",
    "charisma": 20,
    "condition_immunities": "poisoned",
    "constitution": 17,
    "damage_immunities": "poison",
    "damage_resistances": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical weapons",
    "deception": 8,
    "dexterity": 18,
    "hit_dice": "10d8+30",
    "hit_points": 75,
    "id": "dream_eater",
    "insight": 4,
    "intelligence": 16,
    "languages": "Celestial, Common, Draconic, Infernal, telepathy 100 ft.",
    "name": "Dream Eater",
    "persuasion": 8,
    "senses": "darkvision 60 ft., passive Perception 11",
    "size": "Medium",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "The dream eater can use its turn to polymorph into a Small or Medium humanoid it has seen, or back into its true form. Its statistics, other than its size, are the same in all forms. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies.",
            "name": "Shapechanger"
        },
        {
            "attack_bonus": 0,
            "desc": "the dream eater's innate spellcasting ability is Charisma (spell save DC 16). It can innately cast the following spells, requiring no material components:\n\nat will: command\n\n3/day: suggestion",
            "name": "Innate Spellcasting"
        }
    ],
    "speed": "30 ft., fly 20 ft.",
    "speed_json": {
        "fly": 20,
        "walk": 30
    },
    "strength": 15,
    "subtype": "",
    "type": "fiend",
    "wisdom": 13
}