{
    "actions": [
        {
            "desc": "The green knight makes two attacks: one with its battle axe and one with its shield bash.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 7,
            "damage_dice": "1d8+4",
            "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 8 (1d8 + 4) slashing damage, or 9 (1d10 + 4) slashing damage if used with two hands.",
            "name": "Battle Axe"
        },
        {
            "attack_bonus": 7,
            "damage_dice": "1d6+4",
            "desc": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage and the target is grappled (escape DC 15). Until this grapple ends, the target is restrained by magical vines springing forth from the green knight's shield, and the green knight can't make shield bash attacks against other targets.",
            "name": "Shield Bash"
        },
        {
            "attack_bonus": 7,
            "damage_dice": "1d6+4",
            "desc": "Melee or Ranged Weapon Attack: +7 to hit, reach 5 ft. or range 30/120 ft., one target. Hit: 7 (1d6 + 4) piercing damage.",
            "name": "Javelin"
        }
    ],
    "alignment": "lawful neutral",
    "armor_class": 20,
    "armor_desc": "plate, shield",
    "athletics": 7,
    "challenge_rating": 6.0,
    "charisma": 16,
    "condition_immunities": "charmed, frightened",
    "constitution": 14,
    "constitution_save": 5,
    "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical attacks not made with cold iron",
    "dexterity": 10,
    "dexterity_save": 3,
    "hit_dice": "12d8+24",
    "hit_points": 78,
    "id": "green_knight_of_the_woods",
    "intelligence": 10,
    "intimidation": 6,
    "languages": "Common, Elvish, Sylvan",
    "name": "Green Knight of the Woods",
    "reactions": [
        {
            "desc": "When the green knight is hit by a melee attack from a creature it has successfully challenged, it can make one battle axe attack with advantage against the attacker.",
            "name": "Knight's Rebuke"
        }
    ],
    "senses": "darkvision 60 ft., passive Perception 11",
    "size": "Medium",
    "special_abilities": [
        {
            "desc": "If the green knight's head is severed by a vorpal weapon or by other means, magical vines sprout from its neck and the head reattaches by the start of the green knight's next turn, preventing the green knight from dying from the loss of its head.",
            "name": "Headsman's Woe"
        },
        {
            "desc": "As a bonus action, the green knight targets one creature that it can see within 30 feet and issues a challenge. If the target can see the green knight, it must succeed on a DC 14 Wisdom saving throw or become magically compelled to engage the green knight in melee combat for 1 minute, or until the knight challenges a new opponent. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\n\nOn its turn, the affected creature must move towards the green knight and make a melee attack against the green knight.",
            "name": "Knight's Challenge (3/Day)"
        },
        {
            "desc": "The green knight has advantage on saving throws against spells and other magical effects.",
            "name": "Magic Resistance"
        },
        {
            "desc": "The green knight can communicate with beasts and plants as if they shared a language.",
            "name": "Speak with Beasts and Plants"
        }
    ],
    "speed": "30 ft.",
    "speed_json": {
        "walk": 30
    },
    "strength": 18,
    "subtype": "",
    "survival": 4,
    "type": "fey",
    "wisdom": 12
}