{
    "actions": [
        {
            "attack_bonus": 5,
            "damage_dice": "1d10",
            "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 8 (1d10 + 3) piercing damage plus 22 (5d8) poison damage, or half as much poison damage with a successful DC 12 Constitution saving throw. A target dropped to 0 hit points by this attack is stable but poisoned and paralyzed for 1 hour, even after regaining hit points.",
            "name": "Bite"
        }
    ],
    "alignment": "unaligned",
    "armor_class": 18,
    "armor_desc": "natural armor",
    "challenge_rating": 3.0,
    "charisma": 6,
    "constitution": 15,
    "dexterity": 17,
    "hit_dice": "10d10+20",
    "hit_points": 75,
    "id": "j'ba_fofi_spider",
    "intelligence": 4,
    "name": "J'ba Fofi Spider",
    "senses": "blindsight 10 ft., darkvision 60 ft., passive Perception 11",
    "size": "Large",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "The j'ba fofi spider gains an additional +2 to Stealth (+7 in total) in forest or jungle terrain.",
            "name": "Jungle Stealth"
        },
        {
            "attack_bonus": 0,
            "desc": "It takes a successful DC 15 Wisdom (Perception) check to spot the j'ba fofi's web. A creature that fails to notice a web and comes into contact with it is restrained by the web. A restrained creature can pull free from the web by using an action and making a successful DC 12 Strength check. The web can be attacked and destroyed (AC 10; hp 5; vulnerable to fire damage; immune to bludgeoning, poison, and psychic damage).",
            "name": "Camouflaged Webs"
        },
        {
            "attack_bonus": 0,
            "desc": "The j'ba fofi can climb difficult surfaces, including upside down on ceilings, without needing to make an ability check.",
            "name": "Spider Climb"
        },
        {
            "attack_bonus": 0,
            "desc": "No ordinary spider will attack the j'ba fofi unless magically controlled or the j'ba fofi attacks it first. In addition, every j'ba fofi is accompanied by a swarm of spiders (a variant of the swarm of insects), which moves and attacks according to the j'ba fofi's mental command (commanding the swarm does not require an action by the j'ba fofi).",
            "name": "Spider Symbiosis"
        },
        {
            "attack_bonus": 0,
            "desc": "While in contact with a web, the j'ba fofi knows the exact location of any other creature in contact with the same web.",
            "name": "Web Sense"
        },
        {
            "attack_bonus": 0,
            "desc": "The j'ba fofi ignores movement restrictions caused by webbing.",
            "name": "Web Walker"
        }
    ],
    "speed": "40 ft., climb 40 ft.",
    "speed_json": {
        "climb": 40,
        "walk": 40
    },
    "stealth": 5,
    "strength": 17,
    "subtype": "",
    "type": "beast",
    "wisdom": 13
}