{
    "actions": [
        {
            "attack_bonus": 0,
            "desc": "The giant makes two greatclub attacks and a frightful presence attack, or one rock throwing attack.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 16,
            "damage_dice": "10d8",
            "desc": "Melee Weapon Attack: +16 to hit, reach 30 ft., one target. Hit: 55 (10d8 + 10) bludgeoning damage.",
            "name": "Greatclub"
        },
        {
            "attack_bonus": 16,
            "damage_dice": "6d12",
            "desc": "Ranged Weapon Attack: +16 to hit, range 90/240 ft., one target. Hit: 49 (6d12 + 10) bludgeoning damage.",
            "name": "Rock"
        },
        {
            "attack_bonus": 0,
            "desc": "Each creature of the giant's choice that is within 120 feet of the giant and aware of it must succeed on a DC 19 Wisdom saving throw or become frightened for 1 minute. A creature repeats the saving throw at the end of each of its turns, ending the effect on itself on a success. Once a creature's saving throw is successful, it is immune to the giant's Frightful Presence for the next 24 hours.",
            "name": "Frightful Presence"
        }
    ],
    "alignment": "chaotic neutral",
    "arcana": 10,
    "armor_class": 20,
    "armor_desc": "natural armor",
    "challenge_rating": 22.0,
    "charisma": 14,
    "charisma_save": 8,
    "constitution": 26,
    "constitution_save": 14,
    "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical weapons",
    "dexterity": 8,
    "history": 10,
    "hit_dice": "22d20+176",
    "hit_points": 407,
    "id": "jotun_giant",
    "intelligence": 18,
    "languages": "Common, Giant",
    "legendary_actions": [
        {
            "attack_bonus": 0,
            "desc": "The Jotun giant makes a Wisdom (Perception) check.",
            "name": "Detect"
        },
        {
            "attack_bonus": 0,
            "desc": "If banished, a Jotun giant can return to the plane it departed 2/day. If banished a third time, it cannot return.",
            "name": "Planar Return"
        },
        {
            "attack_bonus": 0,
            "desc": "The Jotun giant can sweep its greatclub in an arc around itself. The sweep affects a semicircular path 30 feet wide around the giant. All targets in that area take 46 (8d8 + 10) bludgeoning damage, or no damage with a successful DC 19 Dexterity saving throw.",
            "name": "Sweeping Blow"
        }
    ],
    "legendary_desc": "The Jotun giant can take 1 legendary action, and only at the end of another creature's turn. The giant regains the spent legendary action at the start of its turn.",
    "name": "Jotun Giant",
    "nature": 10,
    "reactions": [
        {
            "attack_bonus": 0,
            "desc": "If a rock or similar object is hurled at the giant, the giant can, with a successful DC 10 Dexterity saving throw, catch the missile and take no bludgeoning damage from it.",
            "name": "Rock Catching"
        }
    ],
    "senses": "darkvision 120 ft., passive Perception 15",
    "size": "Gargantuan",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "Jotuns suffer no ill effects from age, and are immune to effects that reduce ability scores and hit point maximum.",
            "name": "Immortality"
        },
        {
            "attack_bonus": 0,
            "desc": "the Jotun giant's innate spellcasting ability is Wisdom (spell save DC 19). It can innately cast the following spells, requiring no material components:\n\nat will: earthquake, shapechange, speak with animals\n\n3/day: bestow curse, gust of wind\n\n1/day: divination",
            "name": "Innate Spellcasting"
        },
        {
            "attack_bonus": 0,
            "desc": "The giant has advantage on saving throws against spells and other magical effects.",
            "name": "Magic Resistance"
        },
        {
            "attack_bonus": 0,
            "desc": "The giant's weapon attacks are magical.",
            "name": "Magic Weapons"
        },
        {
            "attack_bonus": 0,
            "desc": "The sheer size of the Jotun giant often causes those near it to confuse one at rest for part of the landscape. The jotun has advantage on Stealth checks when not moving.",
            "name": "Too Big to Notice"
        }
    ],
    "speed": "60 ft.",
    "speed_json": {
        "walk": 60
    },
    "stealth": 5,
    "strength": 30,
    "subtype": "",
    "type": "giant",
    "wisdom": 20,
    "wisdom_save": 11
}