{
    "actions": [
        {
            "desc": "The knight of the road makes two longsword attacks or two shortbow attacks.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 5,
            "damage_dice": "1d8+2",
            "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 6 (1d8 + 2) slashing damage, or 7 (1d10 + 2) slashing damage if used with two hands.",
            "name": "Longsword"
        },
        {
            "attack_bonus": 5,
            "damage_dice": "1d12+2",
            "desc": "Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 8 (1d12 + 2) piercing damage.",
            "name": "Lance"
        },
        {
            "attack_bonus": 7,
            "damage_dice": "1d6+4",
            "desc": "Ranged Weapon Attack: +7 to hit, range 80/320 ft., one target. Hit: 7 (1d6 + 4) piercing damage and the target must succeed on a DC 15 Constitution saving throw or become poisoned for 1 minute. A poisoned creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
            "name": "Shortbow"
        }
    ],
    "alignment": "lawful evil",
    "arcana": 5,
    "armor_class": 16,
    "armor_desc": "breastplate",
    "challenge_rating": 5.0,
    "charisma": 16,
    "charisma_save": 6,
    "constitution": 14,
    "constitution_save": 5,
    "dexterity": 18,
    "dexterity_save": 7,
    "hit_dice": "18d8+36",
    "hit_points": 117,
    "id": "knight_of_the_road",
    "intelligence": 14,
    "languages": "Common, Elvish, Umbral",
    "name": "Knight of the Road",
    "nature": 5,
    "perception": 4,
    "senses": "darkvision 60 ft., passive Perception 14",
    "size": "Medium",
    "special_abilities": [
        {
            "desc": "The shadow fey has advantage on saving throws against being charmed, and magic can't put it to sleep.",
            "name": "Fey Ancestry"
        },
        {
            "desc": "The shadow fey has advantage on Wisdom (Perception) checks that rely on sight.",
            "name": "Keen Sight"
        },
        {
            "desc": "As a bonus action, the shadow fey designates a creature it can see within 100 feet and obscures the creature and its companions' travel on a particular shadow road. That shadow road will not open for the designated creature or its traveling companions except through powerful magical means such as by a key of Veles. In addition, that shadow road won't lead to its usual destination for the designated creature or its traveling companions, instead leading the group in a meandering loop. This effect lasts for 9 (2d8) days, until the shadow fey removes the effect, or until the shadow fey dies.",
            "name": "Obscure the Way (1/Day)"
        },
        {
            "desc": "As a bonus action while in shadows, dim light, or darkness, the shadow fey disappears into the darkness and reappears in an unoccupied space it can see within 30 feet. A tendril of inky smoke appears at the origin and destination when it uses this trait.",
            "name": "Shadow Traveler (3/Day)"
        },
        {
            "desc": "While in sunlight, the shadow fey has disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight.",
            "name": "Sunlight Sensitivity"
        },
        {
            "desc": "The shadow fey has advantage on Intelligence (Arcana) checks made to know about shadow roads and shadow magic spells or items.",
            "name": "Traveler in Darkness"
        }
    ],
    "speed": "30 ft.",
    "speed_json": {
        "walk": 30
    },
    "stealth": 7,
    "strength": 14,
    "subtype": "elf",
    "survival": 4,
    "type": "humanoid",
    "wisdom": 12,
    "wisdom_save": 4
}