{
    "actions": [
        {
            "attack_bonus": 5,
            "damage_dice": "2d8+3",
            "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 12 (2d8 + 3) piercing damage.",
            "name": "Bite"
        },
        {
            "attack_bonus": 5,
            "damage_dice": "2d6+3",
            "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 10 (2d6 + 3) slashing damage. If the target is a creature other than an undead, it must succeed on a DC 10 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
            "name": "Claws"
        }
    ],
    "alignment": "chaotic evil",
    "arcana": 5,
    "armor_class": 13,
    "challenge_rating": 4.0,
    "charisma": 8,
    "condition_immunities": "charmed, exhaustion, poisoned",
    "constitution": 14,
    "damage_immunities": "poison",
    "damage_resistances": "necrotic",
    "dexterity": 17,
    "hit_dice": "10d8+20",
    "hit_points": 65,
    "id": "necrophage_ghast",
    "intelligence": 16,
    "investigation": 5,
    "languages": "Common",
    "name": "Necrophage Ghast",
    "senses": "darkvision 60 ft., passive Perception 10",
    "size": "Medium",
    "special_abilities": [
        {
            "desc": "Any living creature that starts its turn within 30 feet of the necrophage ghast must succeed on a DC 13 Constitution saving throw or have disadvantage on all saving throws against spells cast by any necrophage ghast for 1 minute. If a creature's saving throw is successful or the effect ends for it, the creature is immune to the stench of all necrophage ghasts for the next 24 hours.",
            "name": "Necrophage Stench"
        },
        {
            "desc": "The necrophage ghast and any undead within 30 feet of it have advantage on saving throws against effects that turn undead.",
            "name": "Turning Defiance"
        },
        {
            "desc": "The necrophage ghast is a 5th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 13, +5 to hit with spell attacks). The necrophage ghast has the following wizard spells prepared: \nCantrips (at will): friends, mage hand, poison spray, prestidigitation\n1st level (4 slots): charm person, false life, magic missile, ray of sickness\n2nd level (3 slots): hold person, invisibility\n3rd level (2 slots): animate dead, hypnotic pattern",
            "name": "Spellcasting"
        }
    ],
    "speed": "30 ft.",
    "speed_json": {
        "walk": 30
    },
    "strength": 10,
    "subtype": "",
    "type": "undead",
    "wisdom": 10
}