{
    "actions": [
        {
            "attack_bonus": 5,
            "damage_dice": "1d4+3",
            "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 5 (1d4 + 3) piercing damage.",
            "name": "Bite"
        },
        {
            "desc": "The skull lantern opens its mouth, releasing a searing beam of light in a 15-foot line that is 5 feet wide. Each creature in that line must make a DC 13 Dexterity saving throw, taking 7 (2d6) fire damage on a failed save, or half as much damage on a successful one.",
            "name": "Fire Beam (Recharge 6)"
        }
    ],
    "alignment": "unaligned",
    "armor_class": "13",
    "challenge_rating": "1/4",
    "charisma": "5",
    "condition_immunities": "charmed, exhaustion, frightened, paralyzed, poisoned, prone, unconscious",
    "constitution": "12",
    "damage_immunities": "poison",
    "dexterity": "16",
    "dexterity_save": 5,
    "hit_dice": "4d4+4",
    "hit_points": "14",
    "id": "skull_lantern",
    "intelligence": "3",
    "languages": "-",
    "name": "Skull Lantern",
    "senses": "passive Perception 8",
    "size": "Tiny",
    "special_abilities": [
        {
            "desc": "When immersed in magical darkness, a skull lantern emits a brilliant flash of light powerful enough to dispel magical darkness in a 30-foot-radius sphere centered on itself, illuminating the area with bright light for 1d4 rounds. Afterwards, the light winks out and the skull falls to the ground, inert. In one week, the skull lantern has a 50% chance of becoming active again, though failure to do so means it will never reanimate.",
            "name": "Flare"
        },
        {
            "desc": "The skull lantern sheds bright light in a 20-foot-radius and dim light for an additional 20 feet.",
            "name": "Illumination"
        },
        {
            "desc": "If damage reduces the skull to 0 hp, it must make a Constitution saving throw with a DC of 5 + the damage taken, unless the damage is radiant or from a critical hit. On a success, the skull drops to 1 hp instead.",
            "name": "Undead Fortitude"
        }
    ],
    "speed": "0 ft., fly 30 ft. (hover)",
    "speed_json": {
        "fly": 30,
        "hover": true,
        "walk": 0
    },
    "strength": "1",
    "subtype": "",
    "type": "undead",
    "wisdom": "6"
}