{
    "actions": [
        {
            "desc": "The storm lord makes two slam attacks or two lightning bolt attacks.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 10,
            "damage_dice": "7d6+5",
            "desc": "Melee Weapon Attack: +10 to hit, reach 10 ft, one target. Hit: 29 (7d6 + 5) bludgeoning damage.",
            "name": "Slam"
        },
        {
            "attack_bonus": 9,
            "damage_dice": "7d8",
            "desc": "Ranged Spell Attack: +9 to hit, range 60 ft., one target. Hit: 31 (7d8) lightning damage.",
            "name": "Lightning Bolt"
        },
        {
            "desc": "The storm lord creates a peal of ear-splitting thunder. Each creature within 30 feet of the storm lord must make a DC 17 Constitution saving throw. On a failure, a target takes 54 (12d8) thunder damage and is deafened. On a success, a target takes half the damage but isn't deafened. The deafness lasts until it is lifted by the lesser restoration spell or similar magic.",
            "name": "Thunder Clap (Recharge 5-6)"
        }
    ],
    "alignment": "neutral",
    "armor_class": 17,
    "armor_desc": "natural armor",
    "athletics": 10,
    "challenge_rating": 13.0,
    "charisma": 18,
    "condition_immunities": "exhaustion, grappled, paralyzed, petrified, poisoned, prone, restrained, unconscious",
    "constitution": 16,
    "constitution_save": 8,
    "damage_immunities": "poison",
    "damage_resistances": "acid, lightning, thunder; bludgeoning, piercing, and slashing from nonmagical attacks",
    "dexterity": 18,
    "hit_dice": "17d12+51",
    "hit_points": 161,
    "id": "storm_lord",
    "intelligence": 12,
    "languages": "Aquan",
    "name": "Storm Lord",
    "nature": 6,
    "perception": 7,
    "senses": "darkvision 120 ft., passive Perception 17",
    "size": "Huge",
    "special_abilities": [
        {
            "desc": "The storm lord is surrounded in a 120-foot-radius by a ferocious storm. The storm imposes disadvantage on ranged weapon attack rolls and Wisdom (Perception) checks based on sight or hearing within the area. The storm lord's own senses and attacks are not impaired by this trait. \n\nThe tempest extinguishes open flames and disperses fog. A flying creature in the tempest must land at the end of its turn or fall. \n\nEach creature that starts its turn within 30 feet of the storm lord must succeed on a DC 16 Strength saving throw or be pushed 15 feet away from the storm lord. Any creature within 30 feet of the storm lord must spend 2 feet of movement for every 1 foot it moves when moving closer to the storm lord.",
            "name": "Tempest"
        }
    ],
    "speed": "50 ft., fly 50 ft. (hover), swim 90 ft.",
    "speed_json": {
        "fly": 50,
        "hover": true,
        "walk": 50
    },
    "strength": 20,
    "strength_save": 10,
    "subtype": "",
    "type": "elemental",
    "wisdom": 14,
    "wisdom_save": 7
}