{
    "actions": [
        {
            "attack_bonus": 0,
            "desc": "The vile barber makes two attacks with its straight razor.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 6,
            "damage_dice": "1d4",
            "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 6 (1d4 + 4) slashing damage.",
            "name": "Straight Razor"
        },
        {
            "attack_bonus": 6,
            "damage_dice": "1d4",
            "desc": "Melee Weapon Attack: +6 to hit, reach 5 ft., one creature that is grappled by the vile barber, incapacitated, or restrained. Hit: 6 (1d4 + 4) slashing damage plus 7 (2d6) necrotic damage. The creature and all its allies who see this attack must make successful DC 15 Wisdom saving throws or become frightened for 1d4 rounds.",
            "name": "Unclean Cut"
        }
    ],
    "alignment": "chaotic evil",
    "armor_class": 15,
    "armor_desc": "leather armor",
    "athletics": 3,
    "challenge_rating": 2.0,
    "charisma": 10,
    "condition_immunities": "frightened",
    "constitution": 10,
    "damage_resistances": "bludgeoning, piercing, and slashing from nonmagical weapons that aren't silvered or made of cold iron",
    "dexterity": 18,
    "hit_dice": "8d6",
    "hit_points": 28,
    "id": "vile_barber",
    "intelligence": 10,
    "languages": "Common, Goblin, Sylvan, Umbral",
    "name": "Vile Barber",
    "senses": "60 ft., passive Perception 9",
    "size": "Small",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "The vile barber has advantage on attack rolls against any creature in the same space with it.",
            "name": "Close-in Slasher"
        },
        {
            "attack_bonus": 0,
            "desc": "The vile barber can take two bonus actions on its turn, instead of one. Each bonus action must be different; it can't use the same bonus action twice in a single turn.",
            "name": "Inhumanly Quick"
        },
        {
            "attack_bonus": 0,
            "desc": "The vile barber can enter, move through, or even remain in a hostile creature's space regardless of the creature's size, without penalty.",
            "name": "Invasive"
        },
        {
            "attack_bonus": 0,
            "desc": "As a bonus action, the vile barber can take the Disengage or Hide action on each of its turns.",
            "name": "Nimble Escape"
        },
        {
            "attack_bonus": 0,
            "desc": "As a bonus action, the vile barber can take the Use an Object action or make a Dexterity (Sleight of Hand) check.",
            "name": "Pilfer"
        },
        {
            "attack_bonus": 0,
            "desc": "As a bonus action, the vile barber magically teleports from an area of dim light or darkness it currently occupies, along with any equipment it is wearing or carrying, up to 80 feet to any other area of dim light or darkness it can see. The barber then has advantage on the first melee attack it makes before the end of the turn.",
            "name": "Shadow Step"
        }
    ],
    "speed": "30 ft.",
    "speed_json": {
        "walk": 30
    },
    "stealth": 6,
    "strength": 12,
    "subtype": "",
    "type": "fey",
    "wisdom": 8
}