{
    "actions": [
        {
            "desc": "A weirding scroll beguiles one humanoid that it can see within 30 feet. The target must succeed on a DC 13 Wisdom saving throw or be charmed for 1 hour. The charmed creature obeys the telepathic commands of the weirding scroll to the best of its ability. This action works like the dominate person spell, except the weirding scroll doesn't need to concentrate to maintain the domination, and it can't take total and precise control of the target. The weirding scroll can have only one humanoid under its control at one time. If it dominates another, the effect on the previous target ends.",
            "name": "Dominate"
        },
        {
            "attack_bonus": 5,
            "damage_dice": "1d6",
            "desc": "Melee Spell Attack: +5 to hit, reach 10 ft., one target. Hit: 3 (1d6) psychic damage plus 3 (1d6) radiant damage.",
            "name": "Tendril of Light"
        }
    ],
    "alignment": "unaligned",
    "armor_class": "10",
    "challenge_rating": "1/2",
    "charisma": "8",
    "condition_immunities": "blinded, charmed, deafened, frightened, paralyzed, petrified, poisoned",
    "constitution": "15",
    "damage_immunities": "poison, psychic",
    "damage_resistances": "cold; bludgeoning, piercing, and slashing damage from nonmagical attacks",
    "damage_vulnerabilities": "fire",
    "deception": 5,
    "dexterity": "10",
    "hit_dice": "6d4+12",
    "hit_points": "27",
    "id": "weirding_scroll",
    "intelligence": "16",
    "languages": "all, telepathy 120 ft.",
    "name": "Weirding Scroll",
    "senses": "blindsight 60 ft. (blind beyond this radius), passive perception 10",
    "size": "Tiny",
    "special_abilities": [
        {
            "desc": "The weirding scroll is incapacitated while in the area of an antimagic field. If targeted by dispel magic, the weirding scroll must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute.",
            "name": "Antimagic Susceptibility"
        },
        {
            "desc": "While the weirding scroll remains motionless, it is indistinguishable from a normal scroll.",
            "name": "False Appearance"
        }
    ],
    "speed": "0 ft., fly 10 ft.",
    "speed_json": {
        "fly": 10,
        "walk": 0
    },
    "strength": "1",
    "subtype": "",
    "type": "construct",
    "wisdom": "10",
    "wisdom_save": 2
}