{
    "actions": [
        {
            "desc": "The whisperer in the darkness makes two Grasp of the Void attacks.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 12,
            "damage_dice": "6d6",
            "desc": "Melee Spell Attack: +12 to hit, reach 5 ft., one target. Hit: 21 (6d6) force damage, and the target must succeed on a DC 18 Constitution saving throw or be stunned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
            "name": "Grasp of the Void"
        }
    ],
    "alignment": "neutral evil",
    "arcana": 17,
    "armor_class": 17,
    "armor_desc": "natural armor",
    "challenge_rating": 15.0,
    "charisma": 16,
    "charisma_save": 8,
    "condition_immunities": "frightened, charmed, poisoned",
    "constitution": 21,
    "constitution_save": 10,
    "damage_immunities": "psychic, poison",
    "damage_resistances": "cold, fire, lightning; bludgeoning, piercing, and slashing from nonmagical attacks not made with silver",
    "deception": 13,
    "dexterity": 19,
    "hit_dice": "15d8+75",
    "hit_points": 142,
    "id": "whisperer_in_darkness",
    "intelligence": 25,
    "languages": "all, telepathy 60 ft.",
    "medicine": 9,
    "name": "Whisperer in Darkness",
    "perception": 9,
    "senses": "truesight 120 ft., passive Perception 19",
    "size": "Medium",
    "special_abilities": [
        {
            "desc": "The whisperer is a highly advanced being that often carries pieces of powerful wands of fireballs shaped like staves with peculiar triggers, eyes of the eagle shaped as a pair of cylinders, or a helm of telepathy in the form of a glowing metal disc adhered to the side of the creature's head.",
            "name": "Disquieting Technology"
        },
        {
            "desc": "The whisperer has advantage on saving throws against spells and other magical effects.",
            "name": "Magic Resistance"
        },
        {
            "desc": "The whisperer's innate spellcasting ability is Intelligence (spell save DC 20). The whisperer can innately cast the following spells, requiring no material components:\nAt will: alter self, detect magic, detect thoughts, disguise self, fear, identify, invisibility (self only), misty step, sleep, suggestion\n3/day each: confusion, dimension door, disintegrate, dream, modify memory, plane shift, teleport\n1/day each: feeblemind, meteor swarm, mind blank, weird",
            "name": "Innate Spellcasting"
        }
    ],
    "speed": "30 ft.",
    "speed_json": {
        "walk": 30
    },
    "stealth": 9,
    "strength": 15,
    "subtype": "",
    "type": "aberration",
    "wisdom": 18,
    "wisdom_save": 9
}