{
    "actions": [
        {
            "desc": "The white stag makes one gore attack and one hooves attack.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 5,
            "damage_dice": "1d8+3",
            "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one target. Hit: 7 (1d8 + 3) piercing damage.",
            "name": "Gore"
        },
        {
            "attack_bonus": 5,
            "damage_dice": "2d6+3",
            "desc": "Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 10 (2d6 + 3) bludgeoning damage.",
            "name": "Hooves"
        }
    ],
    "alignment": "chaotic good",
    "armor_class": 13,
    "armor_desc": "natural armor",
    "athletics": 5,
    "challenge_rating": 2.0,
    "charisma": 15,
    "constitution": 13,
    "dexterity": 15,
    "hit_dice": "7d10+7",
    "hit_points": 45,
    "id": "white_stag",
    "insight": 4,
    "intelligence": 10,
    "languages": "understands Celestial, Common, Elvish and Sylvan but can't speak",
    "name": "White Stag",
    "perception": 4,
    "senses": "darkvision 60 ft., passive Perception 14",
    "size": "Large",
    "special_abilities": [
        {
            "desc": "When the white stag dies, the deity that created it curses the creature that dealt the killing blow. The cursed creature finds the natural world working against it: roots randomly rise up to trip the creature when it walks past a tree (5% chance per mile traveled in forested terrain), animals are more reluctant to obey (disadvantage on Wisdom (Animal Handling) checks), and the wind seems to always be blowing in the least favorable direction for the creature (scattering papers, sending the creature's scent in the direction of a creature tracking it, etc.). This curse lasts until it is lifted by a remove curse spell or after the cursed creature completes a task of penance for the deity or its temple.",
            "name": "Beloved by the Gods"
        },
        {
            "desc": "Difficult terrain doesn't slow the white stag's travel while in a forest.",
            "name": "Forest Runner"
        },
        {
            "desc": "With a 10-foot running start, the white stag can long jump up to 25 feet.",
            "name": "Running Leap"
        }
    ],
    "speed": "60 ft.",
    "speed_json": {
        "walk": 60
    },
    "strength": 17,
    "subtype": "",
    "type": "celestial",
    "wisdom": 14
}