{
    "actions": [
        {
            "attack_bonus": 0,
            "desc": "The zmey makes one bite attack per head and one claws attack.",
            "name": "Multiattack"
        },
        {
            "attack_bonus": 11,
            "damage_dice": "2d12",
            "desc": "Melee Weapon Attack: +11 to hit, reach 10 ft., one target. Hit: 19 (2d12 + 6) piercing damage.",
            "name": "Bite"
        },
        {
            "attack_bonus": 11,
            "damage_dice": "2d12",
            "desc": "Melee Weapon Attack: +11 to hit, reach 5 ft., one target. Hit: 19 (2d12 + 6) slashing damage.",
            "name": "Claws"
        },
        {
            "attack_bonus": 11,
            "damage_dice": "2d8",
            "desc": "Melee Weapon Attack: +11 to hit, reach 20 ft., one target. Hit: 15 (2d8 + 6) bludgeoning damage.",
            "name": "Tail"
        },
        {
            "attack_bonus": 0,
            "desc": "The zmey breathes up to three 60-foot cones of fire, one from each of its heads. Creatures in a cone take 16 (3d10) fire damage, or half damage with a successful DC 16 Dexterity saving throw. If cones overlap, their damage adds together but each target makes only one saving throw. A zmey can choose whether this attack harms plants or plant creatures.",
            "name": "Fire Breath (Recharge 5-6)"
        }
    ],
    "alignment": "chaotic evil",
    "armor_class": 18,
    "armor_desc": "natural armor",
    "challenge_rating": "14",
    "charisma": 12,
    "charisma_save": 6,
    "condition_immunities": "paralyzed, unconscious",
    "constitution": 19,
    "constitution_save": 9,
    "damage_resistances": "cold, fire",
    "dexterity": 13,
    "hit_dice": "18d12+72",
    "hit_points": 189,
    "id": "zmey",
    "intelligence": 16,
    "languages": "Common, Draconic, Elvish, Sylvan",
    "legendary_actions": [
        {
            "attack_bonus": 0,
            "desc": "The zmey makes a bite attack.",
            "name": "Bite"
        },
        {
            "attack_bonus": 0,
            "desc": "The zmey makes a tail attack.",
            "name": "Tail Attack"
        },
        {
            "attack_bonus": 0,
            "desc": "The zmey moves up to half its land speed. It can enter enemy-occupied spaces but can't end its move there. Creatures in spaces the zmey enters must make successful DC 14 Dexterity saving throws or take 10 (1d8 + 6) bludgeoning damage and fall prone.",
            "name": "Trample"
        }
    ],
    "legendary_desc": "The zmey can take 1 legendary action per head, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The zmey regains spent legendary actions at the start of its turn.",
    "name": "Zmey",
    "perception": 8,
    "senses": "blindsight 60 ft., darkvision 90 ft., passive Perception 18",
    "size": "Huge",
    "special_abilities": [
        {
            "attack_bonus": 0,
            "desc": "The zmey can breathe air and water.",
            "name": "Amphibious"
        },
        {
            "attack_bonus": 0,
            "desc": "A zmey spends much of its time lurking in lakes and ponds. When submerged in a natural pool of standing water, it can transport itself as a bonus action to a similar body of water within 5,000 feet. Rapidly flowing water doesn't serve for this ability, but the zmey can leap to or from a river or stream where the water is calm and slow-moving.",
            "name": "Lake Leap"
        },
        {
            "attack_bonus": 0,
            "desc": "If the zmey fails a saving throw, it can count it as a success instead.",
            "name": "Legendary Resistance (1/Day)"
        },
        {
            "attack_bonus": 0,
            "desc": "The zmey normally has three heads. While it has more than one head, the zmey has advantage on saving throws against being blinded, charmed, deafened, frightened, and stunned. If the zmey takes 40 or more damage in a single turn (and the damage isn't poison or psychic), one of its heads is severed. If all three of its heads are severed, the zmey dies.",
            "name": "Multiheaded"
        },
        {
            "attack_bonus": 0,
            "desc": "The zmey regains 15 hit points at the start of its turn. If the zmey takes acid or fire damage, this trait doesn't function at the start of the zmey's next turn. Regeneration stops functioning when all heads are severed. It takes 24 hours for a zmey to regrow a functional head.",
            "name": "Regeneration"
        },
        {
            "attack_bonus": 0,
            "desc": "The severed head of a zmey grows into a zmey headling 2d6 rounds after being separated from the body. Smearing at least a pound of salt on the severed head's stump prevents this transformation.",
            "name": "Spawn Headling"
        }
    ],
    "speed": "30 ft., fly 50 ft., swim 30 ft.",
    "speed_json": {
        "fly": 50,
        "swim": 30,
        "walk": 30
    },
    "strength": 22,
    "subtype": "",
    "type": "dragon",
    "wisdom": 16,
    "wisdom_save": 8
}