{
    "age": "**_Age._** A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.",
    "alignment": "**_Alignment._** Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways.",
    "asi": [
        {
            "attributes": [
                "Dexterity"
            ],
            "value": 2
        }
    ],
    "asi-desc": "**_Ability Score Increase._** Your Dexterity score increases by 2.",
    "desc": "## Halfling Traits\nYour halfling character has a number of traits in common with all other halflings.",
    "id": "halfling",
    "languages": "**_Languages._** You can speak, read, and write Common and Halfling. The Halfling language isn't secret, but halflings are loath to share it with others. They write very little, so they don't have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling.",
    "name": "Halfling",
    "size": "**_Size._** Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small.",
    "speed": {
        "walk": 25
    },
    "speed-desc": "**_Speed._** Your base walking speed is 25 feet.",
    "subtypes": [
        {
            "asi": [
                {
                    "attributes": [
                        "Charisma"
                    ],
                    "value": 1
                }
            ],
            "asi-desc": "**_Ability Score Increase._** Your Charisma score increases by 1.",
            "desc": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You're inclined to be affable and get along well with others.\nLightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life.",
            "name": "Lightfoot",
            "traits": "**_Naturally Stealthy._** You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
        }
    ],
    "traits": "**_Lucky._** When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.\n\n**_Brave._** You have advantage on saving throws against being frightened.\n\n**_Halfling Nimbleness._** You can move through the space of any creature that is of a size larger than yours."
}